app/Models/NewsModel.php

        public function getNews($slug = false)
        {
            if ($slug === false) {
                return $this->findAll();
            }

            return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `slug` = 'say-it-isnt-so'
 LIMIT 1